<a href="https://colab.research.google.com/github/Lakshman3556/Machine_Learning/blob/main/Week2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd

data = {
    'Item': ['TV', 'TV', 'TV', 'AC'],
    'Company': ['LG', 'VIDEOCON', 'LG', 'SONY'],
    'Rupees': [12000, 10000, 15000, 14000],
    'USD': [700, 650, 800, 750]
}

df = pd.DataFrame(data)
print(df)

  Item   Company  Rupees  USD
0   TV        LG   12000  700
1   TV  VIDEOCON   10000  650
2   TV        LG   15000  800
3   AC      SONY   14000  750

In [5]:
df.loc[len(df)]=['AC','LG',4500,500]

In [6]:
lg_tv = df[(df['Item'] == 'TV') & (df['Company'] == 'LG')]
print("Maximum price of LG TV:", lg_tv['Rupees'].max())

Maximum price of LG TV: 15000

In [7]:
print( df['Rupees'].sum())

55500

In [8]:
sony = df[df['Company'] == 'SONY']
print( sony['USD'].median())

750.0

In [9]:
sorted_df = df.sort_values(by='Rupees')
print(sorted_df)

  Item   Company  Rupees  USD
4   AC        LG    4500  500
1   TV  VIDEOCON   10000  650
0   TV        LG   12000  700
3   AC      SONY   14000  750
2   TV        LG   15000  800

In [10]:
data2 = {
    'Name': ['Aparna', 'Pankaj', 'Ram', 'Ramesh', 'Naveen', 'Krrishnav', 'Bhawna'],
    'Degree': ['MBA', 'BCA', 'M.Tech', 'MBA', 'MBA', 'BCA', 'MBA'],
    'Score': [90, None, 80, 98, 97, 78, 89]
}

df2 = pd.DataFrame(data2)
print(df2)

        Name  Degree  Score
0     Aparna     MBA   90.0
1     Pankaj     BCA    NaN
2        Ram  M.Tech   80.0
3     Ramesh     MBA   98.0
4     Naveen     MBA   97.0
5  Krrishnav     BCA   78.0
6     Bhawna     MBA   89.0

In [11]:
print(df2.groupby('Degree')['Score'].max())

Degree
BCA       78.0
M.Tech    80.0
MBA       98.0
Name: Score, dtype: float64

In [12]:
df2['Score'] = df2['Score'].fillna(76)
print(df2)

        Name  Degree  Score
0     Aparna     MBA   90.0
1     Pankaj     BCA   76.0
2        Ram  M.Tech   80.0
3     Ramesh     MBA   98.0
4     Naveen     MBA   97.0
5  Krrishnav     BCA   78.0
6     Bhawna     MBA   89.0

In [13]:
df2 = df2.set_index('Name')
print(df2)

           Degree  Score
Name
Aparna        MBA   90.0
Pankaj        BCA   76.0
Ram        M.Tech   80.0
Ramesh        MBA   98.0
Naveen        MBA   97.0
Krrishnav     BCA   78.0
Bhawna        MBA   89.0

In [14]:
print(df2.groupby('Degree')['Score'].mean())

Degree
BCA       77.0
M.Tech    80.0
MBA       93.5
Name: Score, dtype: float64

In [16]:
print( (df2['Degree'] == 'MBA').sum())

4

In [17]:
bca_scores = df2[df2['Degree'] == 'BCA']['Score']
print( bca_scores.mode()[0])

76.0